# DivisionGap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartMakerMethodToDivideVolumes..::..DivisionGap Property
PartMakerMethodToDivideVolumes Class See Also
---
The gap which is created between matching profiles of parts.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double DivisionGap { get; set; }
```

Visual Basic
---
```text
Public Property DivisionGap As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double DivisionGap {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for divisionGap must be between 0 and 30000 feet. |

# See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace